Revit 2024 API
DocumentSynchronizedWithCentralEventArgs Class
 The event arguments used by the DocumentSynchronizedWithCentralEventArgs event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class DocumentSynchronizedWithCentralEventArgs : RevitAPIPostDocEventArgs
Visual Basic
Public Class DocumentSynchronizedWithCentralEventArgs _
	Inherits RevitAPIPostDocEventArgs
Visual C++
public ref class DocumentSynchronizedWithCentralEventArgs : public RevitAPIPostDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentSynchronizedWithCentralEventArgs
See Also
DocumentSynchronizedWithCentralEventArgs Members
Autodesk.Revit.DB.Events Namespace